var cityList = [{
    "id": 1,
    "city": [{
        "id": 1000,
        "name": "直辖市"
    },{
        "id": 1001,
        "name": "北京市"
    },
    {
        "id": 1002,
        "name": "上海市"
    },
    {
        "id": 1003,
        "name": "深圳市"
    },
    {
        "id": 1004,
        "name": "广州市"
    },
    {
        "id": 1005,
        "name": "重庆市"
    },
    {
        "id": 1006,
        "name": "天津市"
    }],
    "name": "直辖市"
},
{
    "id": 2,
    "city": [{
        "id": 2000,
        "name": "广东省"
    },{
        "id": 2001,
        "name": "广州市"
    },
    {
        "id": 2002,
        "name": "深圳市"
    },
    {
        "id": 2003,
        "name": "东莞市"
    },
    {
        "id": 2004,
        "name": "中山市"
    },
    {
        "id": 2005,
        "name": "佛山市"
    },
    {
        "id": 2006,
        "name": "珠海市"
    },
    {
        "id": 2007,
        "name": "惠州市"
    },
    {
        "id": 2008,
        "name": "汕头市"
    },
    {
        "id": 2009,
        "name": "湛江市"
    },
    {
        "id": 2010,
        "name": "潮州市"
    },
    {
        "id": 2011,
        "name": "潮阳市"
    },
    {
        "id": 2012,
        "name": "江门市"
    },
    {
        "id": 2013,
        "name": "汕尾市"
    },
    {
        "id": 2014,
        "name": "茂名市"
    },
    {
        "id": 2015,
        "name": "阳江市"
    },
    {
        "id": 2016,
        "name": "肇庆市"
    },
    {
        "id": 2017,
        "name": "梅州市"
    },
    {
        "id": 2018,
        "name": "云浮市"
    },
    {
        "id": 2019,
        "name": "清远市"
    },
    {
        "id": 2020,
        "name": "韶关市"
    },
    {
        "id": 2021,
        "name": "河源市"
    },
    {
        "id": 2022,
        "name": "揭阳市"
    },
    {
        "id": 2023,
        "name": "其他"
    }],
    "name": "广东省"
},
{
    "id": 3,
    "city": [{
        "id": 3000,
        "name": "江苏省"
    },{
        "id": 3001,
        "name": "南京市"
    },
    {
        "id": 3002,
        "name": "苏州市"
    },
    {
        "id": 3003,
        "name": "无锡市"
    },
    {
        "id": 3004,
        "name": "扬州市"
    },
    {
        "id": 3005,
        "name": "常州市"
    },
    {
        "id": 3006,
        "name": "镇江市"
    },
    {
        "id": 3007,
        "name": "南通市"
    },
    {
        "id": 3008,
        "name": "江阴市"
    },
    {
        "id": 3009,
        "name": "连云港市"
    },
    {
        "id": 3010,
        "name": "徐州市"
    },
    {
        "id": 3011,
        "name": "淮阴市"
    },
    {
        "id": 3012,
        "name": "宿迁市"
    },
    {
        "id": 3013,
        "name": "东台市"
    },
    {
        "id": 3014,
        "name": "泰州市"
    },
    {
        "id": 3015,
        "name": "仪征市"
    },
    {
        "id": 3016,
        "name": "丹阳市"
    },
    {
        "id": 3017,
        "name": "宜兴市"
    },
    {
        "id": 3018,
        "name": "常熟市"
    },
    {
        "id": 3019,
        "name": "淮安市"
    },
    {
        "id": 3020,
        "name": "盐城市"
    },
    {
        "id": 3021,
        "name": "兴化市"
    },
    {
        "id": 3022,
        "name": "姜堰市"
    },
    {
        "id": 3023,
        "name": "昆山市"
    },
    {
        "id": 3024,
        "name": "其他"
    }],
    "name": "江苏省"
},
{
    "id": 4,
    "city": [{
        "id": 4000,
        "name": "浙江省"
    },{
        "id": 4001,
        "name": "杭州市"
    },
    {
        "id": 4002,
        "name": "宁波市"
    },
    {
        "id": 4003,
        "name": "温州市"
    },
    {
        "id": 4004,
        "name": "金华市"
    },
    {
        "id": 4005,
        "name": "义乌市"
    },
    {
        "id": 4006,
        "name": "绍兴市"
    },
    {
        "id": 4007,
        "name": "湖州市"
    },
    {
        "id": 4008,
        "name": "余姚市"
    },
    {
        "id": 4009,
        "name": "临海市"
    },
    {
        "id": 4010,
        "name": "萧山市"
    },
    {
        "id": 4011,
        "name": "临安市"
    },
    {
        "id": 4012,
        "name": "诸暨市"
    },
    {
        "id": 4013,
        "name": "嵊泗"
    },
    {
        "id": 4014,
        "name": "绍兴县"
    },
    {
        "id": 4015,
        "name": "兰溪县"
    },
    {
        "id": 4016,
        "name": "嘉兴市"
    },
    {
        "id": 4017,
        "name": "海宁市"
    },
    {
        "id": 4018,
        "name": "桐乡市"
    },
    {
        "id": 4019,
        "name": "衢州市"
    },
    {
        "id": 4020,
        "name": "上虞市"
    },
    {
        "id": 4021,
        "name": "嵊州市"
    },
    {
        "id": 4022,
        "name": "慈溪市"
    },
    {
        "id": 4023,
        "name": "丽水市"
    },
    {
        "id": 4024,
        "name": "瓯海"
    },
    {
        "id": 4025,
        "name": "黄岩"
    },
    {
        "id": 4026,
        "name": "椒江市"
    },
    {
        "id": 4027,
        "name": "台州市"
    },
    {
        "id": 4028,
        "name": "舟山市"
    },
    {
        "id": 4029,
        "name": "其他"
    }],
    "name": "浙江省"
},
{
    "id": 5,
    "city": [{
        "id": 5000,
        "name": "福建省"
    },{
        "id": 5001,
        "name": "福州市"
    },
    {
        "id": 5002,
        "name": "厦门市"
    },
    {
        "id": 5003,
        "name": "泉州市"
    },
    {
        "id": 5004,
        "name": "漳州市"
    },
    {
        "id": 5005,
        "name": "石狮市"
    },
    {
        "id": 5006,
        "name": "三明市"
    },
    {
        "id": 5007,
        "name": "南平市"
    },
    {
        "id": 5008,
        "name": "莆田市"
    },
    {
        "id": 5009,
        "name": "永安市"
    },
    {
        "id": 5010,
        "name": "邵武市"
    },
    {
        "id": 5011,
        "name": "龙岩市"
    },
    {
        "id": 5012,
        "name": "其他"
    }],
    "name": "福建省"
},
{
    "id": 6,
    "city": [{
        "id": 6000,
        "name": "湖南省"
    },{
        "id": 6001,
        "name": "长沙市"
    },
    {
        "id": 6002,
        "name": "湘潭市"
    },
    {
        "id": 6003,
        "name": "岳阳市"
    },
    {
        "id": 6004,
        "name": "株洲市"
    },
    {
        "id": 6005,
        "name": "张家界市"
    },
    {
        "id": 6006,
        "name": "衡阳市"
    },
    {
        "id": 6007,
        "name": "郴州市"
    },
    {
        "id": 6008,
        "name": "湘乡市"
    },
    {
        "id": 6009,
        "name": "汨罗市"
    },
    {
        "id": 6010,
        "name": "常德市"
    },
    {
        "id": 6011,
        "name": "津市市"
    },
    {
        "id": 6012,
        "name": "吉首市"
    },
    {
        "id": 6013,
        "name": "娄底市"
    },
    {
        "id": 6014,
        "name": "涟源市"
    },
    {
        "id": 6015,
        "name": "冷水江市"
    },
    {
        "id": 6016,
        "name": "怀化市"
    },
    {
        "id": 6017,
        "name": "洪江市"
    },
    {
        "id": 6018,
        "name": "益阳市"
    },
    {
        "id": 6019,
        "name": "耒阳市"
    },
    {
        "id": 6020,
        "name": "邵阳市"
    },
    {
        "id": 6021,
        "name": "永州市"
    },
    {
        "id": 6022,
        "name": "冷水滩市"
    },
    {
        "id": 6023,
        "name": "其他"
    }],
    "name": "湖南省"
},
{
    "id": 7,
    "city": [{
        "id": 7000,
        "name": "湖北省"
    },{
        "id": 7001,
        "name": "武汉市"
    },
    {
        "id": 7002,
        "name": "宜昌市"
    },
    {
        "id": 7003,
        "name": "孝感市"
    },
    {
        "id": 7004,
        "name": "荆州市"
    },
    {
        "id": 7005,
        "name": "襄樊市"
    },
    {
        "id": 7006,
        "name": "老河口市"
    },
    {
        "id": 7007,
        "name": "枝城市"
    },
    {
        "id": 7008,
        "name": "枣阳市"
    },
    {
        "id": 7009,
        "name": "荆门市"
    },
    {
        "id": 7010,
        "name": "宜城市"
    },
    {
        "id": 7011,
        "name": "黄石市"
    },
    {
        "id": 7012,
        "name": "鄂州市"
    },
    {
        "id": 7013,
        "name": "黄冈市"
    },
    {
        "id": 7014,
        "name": "咸宁市"
    },
    {
        "id": 7015,
        "name": "武穴市"
    },
    {
        "id": 7016,
        "name": "蒲昕市"
    },
    {
        "id": 7017,
        "name": "麻城市"
    },
    {
        "id": 7018,
        "name": "十堰市"
    },
    {
        "id": 7019,
        "name": "恩施市"
    },
    {
        "id": 7020,
        "name": "丹江口市"
    },
    {
        "id": 7021,
        "name": "利川市"
    },
    {
        "id": 7022,
        "name": "天门市"
    },
    {
        "id": 7023,
        "name": "汉川市"
    },
    {
        "id": 7024,
        "name": "洪湖市"
    },
    {
        "id": 7025,
        "name": "应城市"
    },
    {
        "id": 7026,
        "name": "潜江市"
    },
    {
        "id": 7027,
        "name": "安陆市"
    },
    {
        "id": 7028,
        "name": "仙桃市"
    },
    {
        "id": 7029,
        "name": "随州市"
    },
    {
        "id": 7030,
        "name": "石首市"
    },
    {
        "id": 7031,
        "name": "其他"
    }],
    "name": "湖北省"
},
{
    "id": 8,
    "city": [{
        "id": 8000,
        "name": "山东省"
    },{
        "id": 8001,
        "name": "济南市"
    },
    {
        "id": 8002,
        "name": "青岛市"
    },
    {
        "id": 8003,
        "name": "烟台市"
    },
    {
        "id": 8004,
        "name": "淄博市"
    },
    {
        "id": 8005,
        "name": "潍坊市"
    },
    {
        "id": 8006,
        "name": "临沂市"
    },
    {
        "id": 8007,
        "name": "莱芜市"
    },
    {
        "id": 8008,
        "name": "济宁市"
    },
    {
        "id": 8009,
        "name": "荷泽市"
    },
    {
        "id": 8010,
        "name": "日照市"
    },
    {
        "id": 8011,
        "name": "滕州市"
    },
    {
        "id": 8012,
        "name": "聊城市"
    },
    {
        "id": 8013,
        "name": "德州市"
    },
    {
        "id": 8014,
        "name": "滨州市"
    },
    {
        "id": 8015,
        "name": "临清市"
    },
    {
        "id": 8016,
        "name": "青州市"
    },
    {
        "id": 8017,
        "name": "威海市"
    },
    {
        "id": 8018,
        "name": "泰安市"
    },
    {
        "id": 8019,
        "name": "新泰市"
    },
    {
        "id": 8020,
        "name": "曲阜市"
    },
    {
        "id": 8021,
        "name": "东营市"
    },
    {
        "id": 8022,
        "name": "诸城市"
    },
    {
        "id": 8023,
        "name": "枣庄市"
    },
    {
        "id": 8024,
        "name": "其他"
    }],
    "name": "山东省"
},
{
    "id": 9,
    "city": [{
        "id": 9000,
        "name": "辽宁省"
    },{
        "id": 9001,
        "name": "沈阳市"
    },
    {
        "id": 9002,
        "name": "大连市"
    },
    {
        "id": 9003,
        "name": "铁岭市"
    },
    {
        "id": 9004,
        "name": "抚顺市"
    },
    {
        "id": 9005,
        "name": "本溪市"
    },
    {
        "id": 9006,
        "name": "营口市"
    },
    {
        "id": 9007,
        "name": "锦州市"
    },
    {
        "id": 9008,
        "name": "兴城市"
    },
    {
        "id": 9009,
        "name": "北票市"
    },
    {
        "id": 9010,
        "name": "盘锦市"
    },
    {
        "id": 9011,
        "name": "辽阳市"
    },
    {
        "id": 9012,
        "name": "铁法市"
    },
    {
        "id": 9013,
        "name": "鞍山市"
    },
    {
        "id": 9014,
        "name": "瓦房店市"
    },
    {
        "id": 9015,
        "name": "丹东市"
    },
    {
        "id": 9016,
        "name": "葫芦岛市"
    },
    {
        "id": 9017,
        "name": "朝阳市"
    },
    {
        "id": 9018,
        "name": "阜新市"
    },
    {
        "id": 9019,
        "name": "海城市"
    },
    {
        "id": 9020,
        "name": "其他"
    }],
    "name": "辽宁省"
},
{
    "id": 10,
    "city": [{
        "id": 10000,
        "name": "吉林省"
    },{
        "id": 10001,
        "name": "长春市"
    },
    {
        "id": 10002,
        "name": "吉林市"
    },
    {
        "id": 10003,
        "name": "通化市"
    },
    {
        "id": 10004,
        "name": "扶余市"
    },
    {
        "id": 10005,
        "name": "桦甸市"
    },
    {
        "id": 10006,
        "name": "延吉市"
    },
    {
        "id": 10007,
        "name": "图门市"
    },
    {
        "id": 10008,
        "name": "龙井市"
    },
    {
        "id": 10009,
        "name": "敦化市"
    },
    {
        "id": 10010,
        "name": "集安市"
    },
    {
        "id": 10011,
        "name": "浑江市"
    },
    {
        "id": 10012,
        "name": "梅河口市"
    },
    {
        "id": 10013,
        "name": "四平市"
    },
    {
        "id": 10014,
        "name": "公主岭市"
    },
    {
        "id": 10015,
        "name": "辽源市"
    },
    {
        "id": 10016,
        "name": "白城市"
    },
    {
        "id": 10017,
        "name": "洮南市"
    },
    {
        "id": 10018,
        "name": "九台市"
    },
    {
        "id": 10019,
        "name": "其他"
    }],
    "name": "吉林省"
},
{
    "id": 11,
    "city": [{
        "id": 11000,
        "name": "云南省"
    },{
        "id": 11001,
        "name": "昆明市"
    },
    {
        "id": 11002,
        "name": "曲靖市"
    },
    {
        "id": 11003,
        "name": "大理市"
    },
    {
        "id": 11004,
        "name": "玉溪市"
    },
    {
        "id": 11005,
        "name": "丽江市"
    },
    {
        "id": 11006,
        "name": "楚雄市"
    },
    {
        "id": 11007,
        "name": "开远市"
    },
    {
        "id": 11008,
        "name": "迪庆市"
    },
    {
        "id": 11009,
        "name": "东川市"
    },
    {
        "id": 11010,
        "name": "昭通市"
    },
    {
        "id": 11011,
        "name": "个旧市"
    },
    {
        "id": 11012,
        "name": "保山市"
    },
    {
        "id": 11013,
        "name": "文山市"
    },
    {
        "id": 11014,
        "name": "其他"
    }],
    "name": "云南省"
},
{
    "id": 12,
    "city": [{
        "id": 12000,
        "name": "四川省"
    },{
        "id": 12001,
        "name": "成都市"
    },
    {
        "id": 12002,
        "name": "宜宾市"
    },
    {
        "id": 12003,
        "name": "泸州市"
    },
    {
        "id": 12004,
        "name": "内江市"
    },
    {
        "id": 12005,
        "name": "攀枝花市"
    },
    {
        "id": 12006,
        "name": "西昌市"
    },
    {
        "id": 12007,
        "name": "德阳市"
    },
    {
        "id": 12008,
        "name": "雅安市"
    },
    {
        "id": 12009,
        "name": "遂宁市"
    },
    {
        "id": 12010,
        "name": "南充市"
    },
    {
        "id": 12011,
        "name": "绵阳市"
    },
    {
        "id": 12012,
        "name": "广元市"
    },
    {
        "id": 12013,
        "name": "马尔康"
    },
    {
        "id": 12014,
        "name": "达县市"
    },
    {
        "id": 12015,
        "name": "华鉴市"
    },
    {
        "id": 12016,
        "name": "自贡市"
    },
    {
        "id": 12017,
        "name": "乐山市"
    },
    {
        "id": 12018,
        "name": "其他"
    }],
    "name": "四川省"
},
{
    "id": 13,
    "city": [{
        "id": 13000,
        "name": "安徽省"
    },{
        "id": 13001,
        "name": "合肥市"
    },
    {
        "id": 13002,
        "name": "芜湖市"
    },
    {
        "id": 13003,
        "name": "马鞍山市"
    },
    {
        "id": 13004,
        "name": "蚌埠市"
    },
    {
        "id": 13005,
        "name": "铜陵市"
    },
    {
        "id": 13006,
        "name": "淮北市"
    },
    {
        "id": 13007,
        "name": "淮南市"
    },
    {
        "id": 13008,
        "name": "亳州市"
    },
    {
        "id": 13009,
        "name": "巢湖市"
    },
    {
        "id": 13010,
        "name": "黄山市"
    },
    {
        "id": 13011,
        "name": "歙县"
    },
    {
        "id": 13012,
        "name": "宿州市"
    },
    {
        "id": 13013,
        "name": "阜阳市"
    },
    {
        "id": 13014,
        "name": "六安市"
    },
    {
        "id": 13015,
        "name": "滁州市"
    },
    {
        "id": 13016,
        "name": "宣州市"
    },
    {
        "id": 13017,
        "name": "安庆市"
    },
    {
        "id": 13018,
        "name": "其他"
    }],
    "name": "安徽省"
},
{
    "id": 14,
    "city": [{
        "id": 14000,
        "name": "江西省"
    },{
        "id": 14001,
        "name": "南昌市"
    },
    {
        "id": 14002,
        "name": "景德镇市"
    },
    {
        "id": 14003,
        "name": "九江市"
    },
    {
        "id": 14004,
        "name": "鹰潭市"
    },
    {
        "id": 14005,
        "name": "宜春市"
    },
    {
        "id": 14006,
        "name": "新余市"
    },
    {
        "id": 14007,
        "name": "萍乡市"
    },
    {
        "id": 14008,
        "name": "赣州市"
    },
    {
        "id": 14009,
        "name": "吉安市"
    },
    {
        "id": 14010,
        "name": "井冈山市"
    },
    {
        "id": 14011,
        "name": "抚州市"
    },
    {
        "id": 14012,
        "name": "临川市"
    },
    {
        "id": 14013,
        "name": "上饶市"
    },
    {
        "id": 14014,
        "name": "其他"
    }],
    "name": "江西省"
},
{
    "id": 15,
    "city": [{
        "id": 15000,
        "name": "黑龙江省"
    },{
        "id": 15001,
        "name": "哈尔滨市"
    },
    {
        "id": 15002,
        "name": "佳木斯市"
    },
    {
        "id": 15003,
        "name": "牡丹江市"
    },
    {
        "id": 15004,
        "name": "大庆市"
    },
    {
        "id": 15005,
        "name": "齐齐哈尔市"
    },
    {
        "id": 15006,
        "name": "阿城市"
    },
    {
        "id": 15007,
        "name": "肇东市"
    },
    {
        "id": 15008,
        "name": "绥化市"
    },
    {
        "id": 15009,
        "name": "伊春市"
    },
    {
        "id": 15010,
        "name": "鹤岗市"
    },
    {
        "id": 15011,
        "name": "七台河市"
    },
    {
        "id": 15012,
        "name": "双鸭山市"
    },
    {
        "id": 15013,
        "name": "同江市"
    },
    {
        "id": 15014,
        "name": "绥汾河市"
    },
    {
        "id": 15015,
        "name": "鸡西市"
    },
    {
        "id": 15016,
        "name": "北安市"
    },
    {
        "id": 15017,
        "name": "黑河市"
    },
    {
        "id": 15018,
        "name": "五大连池市"
    },
    {
        "id": 15019,
        "name": "其他"
    }],
    "name": "黑龙江省"
},
{
    "id": 16,
    "city": [{
        "id": 16000,
        "name": "河北省"
    },{
        "id": 16001,
        "name": "石家庄市"
    },
    {
        "id": 16002,
        "name": "邯郸市"
    },
    {
        "id": 16003,
        "name": "保定市"
    },
    {
        "id": 16004,
        "name": "张家口市"
    },
    {
        "id": 16005,
        "name": "秦皇岛市"
    },
    {
        "id": 16006,
        "name": "辛集市"
    },
    {
        "id": 16007,
        "name": "邢台市"
    },
    {
        "id": 16008,
        "name": "泊头市"
    },
    {
        "id": 16009,
        "name": "唐山市"
    },
    {
        "id": 16010,
        "name": "北戴河"
    },
    {
        "id": 16011,
        "name": "廊坊市"
    },
    {
        "id": 16012,
        "name": "定州市"
    },
    {
        "id": 16013,
        "name": "南宫市"
    },
    {
        "id": 16014,
        "name": "衡水市"
    },
    {
        "id": 16015,
        "name": "沙河市"
    },
    {
        "id": 16016,
        "name": "沧州市"
    },
    {
        "id": 16017,
        "name": "任丘市"
    },
    {
        "id": 16018,
        "name": "承德市"
    },
    {
        "id": 16019,
        "name": "涿州市"
    },
    {
        "id": 16020,
        "name": "其他"
    }],
    "name": "河北省"
},
{
    "id": 17,
    "city": [{
        "id": 17000,
        "name": "陕西省"
    },{
        "id": 17001,
        "name": "西安市"
    },
    {
        "id": 17002,
        "name": "咸阳市"
    },
    {
        "id": 17003,
        "name": "宝鸡市"
    },
    {
        "id": 17004,
        "name": "铜川市"
    },
    {
        "id": 17005,
        "name": "渭南市"
    },
    {
        "id": 17006,
        "name": "延安市"
    },
    {
        "id": 17007,
        "name": "汉中市"
    },
    {
        "id": 17008,
        "name": "安康市"
    },
    {
        "id": 17009,
        "name": "韩城市"
    },
    {
        "id": 17010,
        "name": "其他"
    }],
    "name": "陕西省"
},
{
    "id": 18,
    "city": [{
        "id": 18000,
        "name": "海南省"
    },{
        "id": 18001,
        "name": "海口市"
    },
    {
        "id": 18002,
        "name": "三亚市"
    },
    {
        "id": 18003,
        "name": "琼海市"
    },
    {
        "id": 18004,
        "name": "通什市"
    },
    {
        "id": 18005,
        "name": "其他"
    }],
    "name": "海南省"
},
{
    "id": 19,
    "city": [{
        "id": 19000,
        "name": "河南省"
    },{
        "id": 19001,
        "name": "郑州市"
    },
    {
        "id": 19002,
        "name": "洛阳市"
    },
    {
        "id": 19003,
        "name": "开封市"
    },
    {
        "id": 19004,
        "name": "鹤壁市"
    },
    {
        "id": 19005,
        "name": "焦作市"
    },
    {
        "id": 19006,
        "name": "许昌市"
    },
    {
        "id": 19007,
        "name": "驻马店市"
    },
    {
        "id": 19008,
        "name": "周口市"
    },
    {
        "id": 19009,
        "name": "新乡市"
    },
    {
        "id": 19010,
        "name": "安阳市"
    },
    {
        "id": 19011,
        "name": "濮阳市"
    },
    {
        "id": 19012,
        "name": "漯河市"
    },
    {
        "id": 19013,
        "name": "信阳市"
    },
    {
        "id": 19014,
        "name": "平顶山市"
    },
    {
        "id": 19015,
        "name": "三门峡市"
    },
    {
        "id": 19016,
        "name": "南阳市"
    },
    {
        "id": 19017,
        "name": "商丘市"
    },
    {
        "id": 19018,
        "name": "义马市"
    },
    {
        "id": 19019,
        "name": "其他"
    }],
    "name": "河南省"
},
{
    "id": 20,
    "city": [{
        "id": 20000,
        "name": "山西省"
    },{
        "id": 20001,
        "name": "太原市"
    },
    {
        "id": 20002,
        "name": "大同市"
    },
    {
        "id": 20003,
        "name": "忻州市"
    },
    {
        "id": 20004,
        "name": "临汾市"
    },
    {
        "id": 20005,
        "name": "运城市"
    },
    {
        "id": 20006,
        "name": "长治市"
    },
    {
        "id": 20007,
        "name": "榆次市"
    },
    {
        "id": 20008,
        "name": "侯马市"
    },
    {
        "id": 20009,
        "name": "阳泉市"
    },
    {
        "id": 20010,
        "name": "晋城市"
    },
    {
        "id": 20011,
        "name": "其他"
    }],
    "name": "山西省"
},
{
    "id": 21,
    "city": [{
        "id": 21000,
        "name": "内蒙古"
    },{
        "id": 21001,
        "name": "呼和浩特市"
    },
    {
        "id": 21002,
        "name": "赤峰市"
    },
    {
        "id": 21003,
        "name": "包头市"
    },
    {
        "id": 21004,
        "name": "二连浩特市"
    },
    {
        "id": 21005,
        "name": "临河市"
    },
    {
        "id": 21006,
        "name": "东胜市"
    },
    {
        "id": 21007,
        "name": "满洲里市"
    },
    {
        "id": 21008,
        "name": "乌兰浩特市"
    },
    {
        "id": 21009,
        "name": "霍林郭勒市"
    },
    {
        "id": 21010,
        "name": "集宁市"
    },
    {
        "id": 21011,
        "name": "乌海市"
    },
    {
        "id": 21012,
        "name": "海拉尔市"
    },
    {
        "id": 21013,
        "name": "牙克石市"
    },
    {
        "id": 21014,
        "name": "锡林浩特市"
    },
    {
        "id": 21015,
        "name": "通辽市"
    },
    {
        "id": 21016,
        "name": "扎兰屯市"
    },
    {
        "id": 21017,
        "name": "鄂尔多斯市"
    },
    {
        "id": 21018,
        "name": "其他"
    }],
    "name": "内蒙古"
},
{
    "id": 22,
    "city": [{
        "id": 22000,
        "name": "广西"
    },{
        "id": 22001,
        "name": "南宁市"
    },
    {
        "id": 22002,
        "name": "桂林市"
    },
    {
        "id": 22003,
        "name": "北海市"
    },
    {
        "id": 22004,
        "name": "柳州市"
    },
    {
        "id": 22005,
        "name": "来宾市"
    },
    {
        "id": 22006,
        "name": "玉林市"
    },
    {
        "id": 22007,
        "name": "百色市"
    },
    {
        "id": 22008,
        "name": "河池市"
    },
    {
        "id": 22009,
        "name": "凭祥市"
    },
    {
        "id": 22010,
        "name": "钦州市"
    },
    {
        "id": 22011,
        "name": "梧州市"
    },
    {
        "id": 22012,
        "name": "合山市"
    },
    {
        "id": 22013,
        "name": "其他"
    }],
    "name": "广西"
},
{
    "id": 23,
    "city": [{
        "id": 23000,
        "name": "贵州省"
    },{
        "id": 23001,
        "name": "贵阳市"
    },
    {
        "id": 23002,
        "name": "遵义市"
    },
    {
        "id": 23003,
        "name": "铜仁市"
    },
    {
        "id": 23004,
        "name": "都匀市"
    },
    {
        "id": 23005,
        "name": "兴义市"
    },
    {
        "id": 23006,
        "name": "赤水市"
    },
    {
        "id": 23007,
        "name": "六盘水市"
    },
    {
        "id": 23008,
        "name": "凯里市"
    },
    {
        "id": 23009,
        "name": "安顺市"
    },
    {
        "id": 23010,
        "name": "其他"
    }],
    "name": "贵州省"
},
{
    "id": 24,
    "city": [{
        "id": 24000,
        "name": "甘肃省"
    },{
        "id": 24001,
        "name": "兰州市"
    },
    {
        "id": 24002,
        "name": "酒泉市"
    },
    {
        "id": 24003,
        "name": "张掖市"
    },
    {
        "id": 24004,
        "name": "临夏市"
    },
    {
        "id": 24005,
        "name": "嘉峪关市"
    },
    {
        "id": 24006,
        "name": "金昌市"
    },
    {
        "id": 24007,
        "name": "平凉市"
    },
    {
        "id": 24008,
        "name": "白银市"
    },
    {
        "id": 24009,
        "name": "武威市"
    },
    {
        "id": 24010,
        "name": "玉门市"
    },
    {
        "id": 24011,
        "name": "天水市"
    },
    {
        "id": 24012,
        "name": "西峰市"
    },
    {
        "id": 24013,
        "name": "其他"
    }],
    "name": "甘肃省"
},
{
    "id": 25,
    "city": [{
        "id": 25000,
        "name": "青海省"
    },{
        "id": 25001,
        "name": "西宁市"
    },
    {
        "id": 25002,
        "name": "格尔木市"
    },
    {
        "id": 25003,
        "name": "共和市"
    },
    {
        "id": 25004,
        "name": "德令哈市"
    },
    {
        "id": 25005,
        "name": "其他"
    }],
    "name": "青海省"
},
{
    "id": 26,
    "city": [{
        "id": 26000,
        "name": "新疆"
    },{
        "id": 26001,
        "name": "乌鲁木齐市"
    },
    {
        "id": 26002,
        "name": "石河子市"
    },
    {
        "id": 26003,
        "name": "克拉玛依市"
    },
    {
        "id": 26004,
        "name": "博乐市"
    },
    {
        "id": 26005,
        "name": "塔城市"
    },
    {
        "id": 26006,
        "name": "阿勒泰市"
    },
    {
        "id": 26007,
        "name": "哈密市"
    },
    {
        "id": 26008,
        "name": "阿克苏市"
    },
    {
        "id": 26009,
        "name": "阿图什市"
    },
    {
        "id": 26010,
        "name": "昌吉市"
    },
    {
        "id": 26011,
        "name": "奎屯市"
    },
    {
        "id": 26012,
        "name": "伊宁市"
    },
    {
        "id": 26013,
        "name": "吐鲁番市"
    },
    {
        "id": 26014,
        "name": "库尔勒市"
    },
    {
        "id": 26015,
        "name": "喀什市"
    },
    {
        "id": 26016,
        "name": "和田市"
    },
    {
        "id": 26017,
        "name": "其他"
    }],
    "name": "新疆"
},
{
    "id": 27,
    "city": [{
        "id": 27000,
        "name": "西藏"
    },{
        "id": 27001,
        "name": "拉萨市"
    },
    {
        "id": 27002,
        "name": "日喀则市"
    },
    {
        "id": 27003,
        "name": "其他"
    }],
    "name": "西藏"
},
{
    "id": 28,
    "city": [{
        "id": 28000,
        "name": "宁夏"
    },{
        "id": 28001,
        "name": "银川市"
    },
    {
        "id": 28002,
        "name": "青铜峡市"
    },
    {
        "id": 28003,
        "name": "吴忠市"
    },
    {
        "id": 28004,
        "name": "石嘴山市"
    },
    {
        "id": 28005,
        "name": "其他"
    }],
    "name": "宁夏"
},
{
    "id": 29,
    "city": [{
        "id": 29000,
        "name": "香港"
    }],
    "name": "香港"
},
{
    "id": 30,
    "city": [{
        "id": 30000,
        "name": "澳门"
    }],
    "name": "澳门"
},
{
    "id": 31,
    "city": [{
        "id": 31000,
        "name": "台湾"
    }],
    "name": "台湾"
}]